public/illiad.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>LZ</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type= "text/css" href="./htmlize.css"><link rel="stylesheet" type= "text/css" href="./styles.css"><link rel="icon"
       href="data:image/svg+xml,<svg xmlns=%22http://www.w3.org/2000/svg%22 viewBox=%220 0 100 100%22><text y=%22.9em%22 font-size=%2290%22>👻</text></svg>"><header>
| <a href="./">home</a>
| <a href="#top">top</a>
| <a href="https://github.com/larzeitlin">github</a>
|
</header>
</head>
<body>
<div id="content" class="content">
<h1 class="title">LZ</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd480f83">A random passage from the illiad</a></li>
</ul>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/scittle@0.6.15/dist/scittle.js" type="application/javascript"></script>
<script crossorigin src="https://unpkg.com/react@17/umd/react.production.min.js"></script>
<script crossorigin src="https://unpkg.com/react-dom@17/umd/react-dom.production.min.js"></script>
<script src="https://cdn.jsdelivr.net/npm/scittle@0.6.15/dist/scittle.reagent.js" type="application/javascript"></script>
<script src="https://cdn.jsdelivr.net/npm/crypto-js@4.2.0/index.min.js"></script>


<div id="outline-container-orgd480f83" class="outline-2">
<h2 id="orgd480f83">A random passage from the illiad</h2>
<div class="outline-text-2" id="text-orgd480f83">
<p>
We've got the book in an asset file on the server. Let's use scittle to randomly choose a sturring quote.
</p>

<body>
<textarea id="code-area"
          class="code-textarea"
	  spellcheck="false">
(require '[reagent.core :as r]
         '[reagent.dom :as rdom]
	 '[clojure.string :as str])

(def passage-atom (r/atom ""))

(defn split-sentences [text]
 (->> (.split (js/String text) #"[.!?]")
      (map str/trim)
      (remove #(or 
                 (re-find #"[\d\[\]]" %)
                 (re-find #"\b[A-Z]{3,}\b" %)))))

(defn choose-quote [text]
  (->> text
       split-sentences
       rand-nth))
    
(defn fetch-text []
    (-> (js/fetch "assets/illiad.txt")
        (.then (fn [response] (.text response)))
        (.then (fn [text]
	         (->> text choose-quote (reset! passage-atom))))
        (.catch (fn [err] (js/console.error err)))))
	
(defn my-component []
  [:div
    [:button {:on-click #(fetch-text)} "tell me something heroic"]
    [:p {:style {:font-family "fantasy"
                 :font-size 30
                 :padding "2em"
                 :background-color "#c9986840"
                 :text-align "center"}}
        (choose-quote @passage-atom)]])

(rdom/render [my-component] (.getElementById js/document "app"))</textarea>
<button onclick="read_input()">eval code</button>
<div id="app"></div>
</body>
<script type="application/x-scittle">

(defn set-output-area [v output-id]
  (-> (js/document.getElementById output-id)
      (.-innerHTML)
      (set! v)))

(defn set-image-src [v output-id]
  (-> (js/document.getElementById output-id)
      (.-src)
      (set! v)))

(defn try-eval [v]
  (try (js/scittle.core.eval_string v)
    (catch js/Error e
      (str "ERROR: " e))))

(defn read-eval-input [input-id]
  (-> input-id
      js/document.getElementById 
      .-value
      try-eval))

(defn run! [] 
  (read-eval-input "code-area"))

(set! (.-read_input js/window)
      run!)

(run!)		

</script>
</div>
</div>
</div>
</body>
</html>
